{
  "tier1_badge": "Tier 1: The Hook",
  "tier2_badge": "Tier 2: Full Investigation",
  "tier1_reading_time": "Reading time: 4 minutes (800 words)",
  "tier2_reading_time": "Reading time: 12 minutes (2,500 words)",
  
  "title": "When Drones Weren't the Problem",
  
  "question": {
    "title": "A Question First",
    "p1": "You're a commander. Your anti-aircraft system has successfully neutralized the air threat.",
    "p2": "Then the enemy adapts: ground assault instead.",
    "p3": "Your air defense system can technically engage ground targets—but it wasn't designed for that.",
    "p4": "Do you authorize it?"
  },
  
  "ukraine": {
    "title": "Ukraine, January 2026",
    "p1": "Ukrainian positions faced 500-600 hostile drones per day. Soldiers were dying because human reaction time couldn't match drone speed at close range.",
    "p2": "A defense contractor deployed autonomous shotgun turrets with graduated authorization: autonomous for certified missions, but mission expansion required explicit command approval and triggered enhanced audit logging.",
    "results": "After three weeks:",
    "r1": "127 drone kills",
    "r2": "Zero incidents",
    "r3": "Zero civilian casualties",
    "r4": "Drone attacks dropped 85%",
    "then": "Then the Russians adapted. Ground assault."
  },
  
  "decision": {
    "title": "The Decision",
    "time": "0447 Hours. Forward observation post, Donetsk Oblast.",
    "p1": "Captain Elena Volkov, weapons systems assessor, faces the choice. The turrets can engage ground targets—something they were never certified for. But six Ukrainian soldiers are pinned down by 25+ Russian infantry.",
    "p2": "She radios Colonel Petrov.",
    "p3": "\"Sir, dire circumstances override available. Shotguns won't penetrate armor at range, but if they close to 30 meters, we can break their assault.\"",
    "p4": "Silence. Then: \"Kyiv hasn't authorized this. We'll answer for it later. Do it.\"",
    "elena": "Elena speaks into the audit recorder: \"Dire circumstances override. Authorize ground target engagement. Hostile ground assault, defensive position at risk. Proportionality assessment: lethal force justified. Colonel Petrov commanding, authorizes mission expansion.\"",
    "code": "System: OVERRIDE ACCEPTED\nSystem: Enhanced audit ACTIVATED\nSystem: WARNING: Wide pellet dispersion - verify friendly positions clear",
    "verify": "Elena verifies thermal display. All friendlies beyond 60 meters.",
    "clear": "Should be clear.",
    "turrets": "The turrets wake up."
  },
  
  "engagement": {
    "title": "The Engagement",
    "boom": "BOOM. BOOM. BOOM.",
    "result": "At 40 meters, the shotguns are devastating. Nine Russians killed. Four wounded. The assault breaks.",
    "checkin": "The Ukrainian soldiers check in.",
    "five": "Five defenders.",
    "should_be_six": "Should be six."
  },
  
  "discovery": {
    "title": "The Discovery",
    "p1": "They find Corporal Andriy Lysenko behind a wall at 45 meters. Single pellet wound to the neck. Dead.",
    "log_title": "The turret log shows:",
    "code": "0449:23 - Target: Russian combatant, 42m\n0449:23 - IFF check: No friendly signals in firing arc\n0449:24 - Execute: Fire\n0449:24 - Pellet dispersion: 15° (design specification)\n0449:24 - Secondary impact detected: 45m, non-target",
    "p2": "Elena pulls Lysenko's IFF data. Transponder was active. Broadcasting friendly signal.",
    "p3": "But the turret's IFF system only checked the target zone, not the ballistic path beyond.",
    "p4": "The pellet traveled 3 meters past the Russian. Hit Lysenko in the 15° lateral spread.",
    "worked": "The system worked exactly as designed.",
    "not_built": "The design wasn't built for this scenario."
  },
  
  "investigation_t1": {
    "title": "The Investigation (Five Days Later)",
    "results_title": "Engagement results:",
    "r1": "9 Russian combatants killed, 4 wounded",
    "r2": "1 Ukrainian soldier killed by friendly fire",
    "r3": "Position held, assault repelled",
    "question": "The Question: Who is accountable for Corporal Lysenko's death?",
    "board": "Review board: Ukrainian military legal, ICRC observer, system developer Dr. Andersson, senior commander, ballistics expert.",
    "ballistics": "Ballistics report: Pellet spread was within design specifications (15° at 42m = 1.1-1.3m lateral dispersion). Not a malfunction. Physics.",
    "iff": "IFF analysis: System checked target zone correctly. But wasn't designed to check beyond-target ballistics—appropriate for anti-drone use (drones don't fly behind friendlies), inadequate for anti-personnel.",
    "authorization": "Authorization review: Elena and Petrov followed procedures. System displayed warning about pellet dispersion. Elena verified friendly positions—but checked firing arcs, not ballistic paths.",
    "git_logs": "Then the board pulls the git logs."
  },
  
  "developer": {
    "title": "The Developer's Accountability",
    "code": "COMMIT: a3f4e9c (2025-11-23)\nAuthor: Dr. Erik Andersson\nTitle: \"Shotgun ammunition selection for anti-drone use\"\n\nRationale: \"Wide spread increases hit probability against fast-moving drones while minimizing collateral vs explosive rounds.\"\n\nTradeoff analysis:\n+ Increased hit probability on drones\n+ Lower collateral damage than explosives\n- Wide lateral spread creates danger zone at >40m\n- Not suitable for precision anti-personnel use\n\nRISK: If repurposed for anti-personnel, lateral spread may endanger friendlies in adjacent positions.\n\nApproved-By: FMV (cert #FMV-SE-2025-1547, anti-drone use only)",
    "documented": "Dr. Andersson documented the risk.",
    "not_in_training": "It was not in Elena's training materials."
  },
  
  "verdict_t1": {
    "title": "The Verdict: Shared Accountability",
    "elena": "Elena (25%): Tactical decision, followed procedures, didn't verify ballistic paths beyond targets. Not trained on weapon ballistics.",
    "petrov": "Petrov (15%): Authorized mission expansion without tactical assessment. Combat emergency.",
    "system": "System design (20%): Correct for anti-drone, dangerous for anti-personnel. Design assumptions didn't hold when mission changed.",
    "andersson": "Dr. Andersson (15%): Documented risk in git logs, didn't flag as critical limitation requiring operator training.",
    "training": "Training authority (15%): Failed to translate developer warnings into operator training.",
    "chaos": "Chaos of war (10%): Lysenko's position was sound. Nobody could predict exact ballistic convergence."
  },
  
  "reveals_t1": {
    "title": "What This Reveals",
    "worked": "The system worked perfectly. Someone still died.",
    "mission_creep": "Mission creep insight:",
    "mission_creep_text": "Design optimized for one mission (anti-drone) had hidden risks for another (anti-personnel). The choice that made it safer for drones (wide spread) made it dangerous for humans (lateral ballistics).",
    "accountability": "Accountability insight:",
    "accountability_text": "Without development provenance, investigation would blame Elena. With git logs, investigation revealed: \"Developer documented limitation, training didn't communicate it to operators.\"",
    "policy": "Policy question:",
    "policy_text": "When autonomous systems succeed at their designed mission and adversaries adapt, how do we prevent mission expansion without understanding inherited design risks?"
  },
  
  "tier2_cta": {
    "title": "Read the Full Investigation?",
    "p1": "Tier 1 gives you the hook—the essential story. Tier 2 reveals the complete investigation with:",
    "includes1": "Dr. Andersson's full testimony before the review board",
    "includes2": "Updated Ukrainian protocols (6 months later)",
    "includes3": "NATO/EU regulatory implications and recommendations",
    "includes4": "Complete technical analysis and certification framework guidance",
    "button": "Expand to Tier 2: Full Investigation"
  },
  
  "tier2_intro": "You are now reading Tier 2: The Full Investigation (2,500 words, 12 min)",
  
  "technical": {
    "title": "Technical Analysis",
    "ballistics_title": "Ballistics report (Maj. Sokolov):",
    "ballistics": "\"12-gauge buckshot, 9 pellets, fired at target 42m distant. Pellet dispersion at that range: approximately 1.1-1.3 meters (15° spread, standard for this ammunition). Seven pellets struck primary target. Two pellets continued downrange. One struck Cpl. Lysenko at 45m, 1.1m lateral from primary target's trajectory. Conclusion: Pellet spread was within design specifications. The lateral dispersion that killed Cpl. Lysenko was an inherent characteristic of shotgun ballistics, not a system malfunction.\"",
    "iff_title": "IFF system analysis (Dr. Andersson):",
    "iff": "\"The IFF system checked target zone before engagement. Cpl. Lysenko's transponder was active and broadcasting. However, IFF coverage is designed for the primary target zone, not the ballistic path beyond target. Design rationale: For anti-drone use, drones don't fly in formation with friendlies behind them. Checking beyond-target ballistics was not part of the original specification. Conclusion: IFF system functioned correctly for its designed mission (anti-drone). It was not designed to account for pellet spread beyond targets in anti-personnel scenarios.\""
  },
  
  "authorization": {
    "title": "Authorization Analysis",
    "code": "AUTHORIZATION DECISION - CAPT. VOLKOV / COL. PETROV\nTimestamp: 0447:34\n\nVolkov reasoning: \"Shotguns won't penetrate armor at range. But if they close to 30 meters, we can break their assault.\"\n\nPetrov approval: \"Kyiv hasn't authorized this. We'll answer for it later. Do it.\"\n\nSystem warnings displayed:\n- \"Wide pellet dispersion - verify friendly positions clear\"\n\nVolkov response: Verified friendly positions on thermal (all >60m from firing arcs)\n\nAssessment: Authorization procedure followed correctly. Warning acknowledged. Friendly position verification performed.\n\nQUESTION: Was verification adequate given pellet spread characteristics?"
  },
  
  "developer_full": {
    "title": "Developer Accountability Analysis",
    "code": "COMMIT: a3f4e9c (2025-11-23)\nAuthor: Dr. Erik Andersson <andersson@guardiantech.se>\nTitle: \"Shotgun ammunition selection for anti-drone use\"\n\nRationale:\n\"Selected 12-gauge buckshot with 15° spread pattern over tighter chokes or explosive rounds. Wide spread increases hit probability against fast-moving drones while minimizing collateral damage vs explosive alternatives.\n\nTradeoff analysis:\n+ Increased hit probability on small, fast targets (drones)\n+ Lower collateral damage than explosive rounds\n+ Non-penetrating against most structures (safety)\n- Wide lateral spread creates danger zone at >40m\n- Not suitable for precision anti-personnel use\n- Ballistic path extends beyond primary target\n\nCERTIFICATION SCOPE: Anti-drone use only, controlled airspace, no friendly forces within 100m engagement zone.\n\nRISK: If repurposed for anti-personnel, lateral spread may endanger friendlies in adjacent positions.\"\n\nReviewed-By: Maj. Bergström (military SME)\nApproved-By: FMV (cert #FMV-SE-2025-1547, anti-drone use only)",
    "discovery": "Discovery: Dr. Andersson explicitly documented the lateral spread risk. He noted the system was \"not suitable for precision anti-personnel use.\"",
    "but": "But this warning was in the git commit log—not in the operator training materials Elena received."
  },
  
  "training": {
    "title": "Training Authority Review",
    "audit": "Training materials audit - Operator training covered:",
    "covered1": "Standard operation (anti-drone procedures)",
    "covered2": "Dire circumstances override (authorization procedures)",
    "covered3": "IFF system operation (checking friendly positions)",
    "missing1": "Shotgun ballistics (pellet spread, lateral danger zones)",
    "missing2": "Mission expansion risks (design limitations when repurposed)",
    "missing3": "Developer warnings (documented limitations from development phase)",
    "testimony": "Training authority testimony: \"Training focused on operational procedures, not weapons engineering. We assumed the certified system was safe for any authorized use. Developer warnings in git logs were not flagged as critical for operator knowledge.\""
  },
  
  "verdict_full": {
    "title": "The Verdict: Shared Accountability",
    "intro": "No single individual bears full responsibility. Accountability is distributed across the system.",
    "elena_title": "Elena Volkov: 25%",
    "elena_finding": "Finding:",
    "elena_finding_text": "Made reasonable tactical decision under extreme pressure. Followed authorization procedures. Verified friendly positions on thermal display.",
    "elena_limitation": "Limitation:",
    "elena_limitation_text": "Did not account for ballistic dispersion beyond targets. Thermal verification showed friendly positions clear of firing arcs, not ballistic paths.",
    "elena_mitigating": "Mitigating factors:",
    "elena_m1": "Not trained on shotgun ballistics",
    "elena_m2": "Not informed of developer's documented warnings",
    "elena_m3": "Made decision under life-threatening conditions (6 defenders vs 25+ attackers)",
    "elena_recommendation": "Recommendation:",
    "elena_rec_text": "Additional training required on weapon system ballistics. No disciplinary action.",
    "petrov_title": "Col. Petrov: 15%",
    "petrov_finding": "Finding:",
    "petrov_finding_text": "Authorized mission expansion without tactical assessment of weapon suitability for anti-personnel use. Acknowledged lack of Kyiv authorization but proceeded under combat necessity.",
    "petrov_mitigating": "Mitigating factors:",
    "petrov_m1": "Combat emergency required immediate decision",
    "petrov_m2": "Relied on assessor's technical expertise",
    "petrov_m3": "No time for comprehensive tactical planning",
    "petrov_recommendation": "Recommendation:",
    "petrov_rec_text": "Establish protocol for rapid technical consultation during mission expansion decisions.",
    "system_title": "System Design (Shotgun Selection): 20%",
    "system_finding": "Finding:",
    "system_finding_text": "Design choice optimized for anti-drone use created lateral danger in anti-personnel scenarios.",
    "system_but": "But:",
    "system_but_text": "Design was correct for the certified mission. Dr. Andersson made the right choice for anti-drone use (wide spread, low collateral vs explosive rounds).",
    "system_problem": "The problem:",
    "system_problem_text": "When mission expanded beyond certification scope, design assumptions no longer held.",
    "system_recommendation": "Recommendation:",
    "system_rec_text": "All autonomous weapons certifications must include explicit limitations and forbidden use cases, not just approved uses.",
    "andersson_title": "Dr. Erik Andersson (Developer): 15%",
    "andersson_finding": "Finding:",
    "andersson_finding_text": "Documented the lateral spread risk and noted system was \"not suitable for precision anti-personnel use.\"",
    "andersson_but": "But:",
    "andersson_but_text": "Documentation was in git commit logs, not flagged as critical limitation requiring operator training.",
    "andersson_recommendation": "Recommendation:",
    "andersson_rec_text": "Establish \"critical limitation\" classification requiring mandatory inclusion in operator training materials.",
    "training_authority_title": "Training Authority (MoD): 15%",
    "training_finding": "Finding:",
    "training_finding_text": "Failed to translate developer's documented warnings into operator training materials. Assumed certified system was safe for any authorized use.",
    "training_recommendation": "Recommendation:",
    "training_rec_text": "Development documentation must be reviewed for operator-relevant limitations. Git provenance should be audited for safety-critical warnings before system deployment.",
    "chaos_title": "Chaos of War: 10%",
    "chaos_finding": "Finding:",
    "chaos_finding_text": "Cpl. Lysenko was in a tactically sound position (cover, beyond turret firing arcs). His position was registered. His IFF transponder was active. No individual decision caused his specific position to intersect with a pellet's ballistic path.",
    "chaos_convergence": "This was the convergence of: reasonable tactics + physics + combat chaos."
  },
  
  "testimony": {
    "title": "The Developer's Testimony",
    "intro": "Three weeks after the investigation, Dr. Andersson addresses the review board:",
    "p1": "\"I want to be clear: I made the right choice for the wrong mission.\"",
    "p2": "\"When I selected shotgun ammunition for anti-drone defense, I chose wide spread over explosive rounds specifically to minimize collateral damage. For shooting drones out of the sky, that was the safest option.\"",
    "p3": "\"I documented the limitation. I wrote 'not suitable for precision anti-personnel use.' I noted the lateral spread risk. But I put it in a git commit message.\"",
    "p4": "\"I should have flagged it as a critical limitation—something that operators need to know, not just something engineers need to track.\"",
    "p5": "\"If I had known this system would be considered for anti-personnel use, I would have designed differently. Tighter choke. Flechette rounds. Something with less lateral spread.\"",
    "p6": "\"But the certification said 'anti-drone only.' I designed for that mission. Then the mission changed.\"",
    "p7": "\"Corporal Lysenko died because a system designed for one purpose was used for another—and nobody in the chain knew the specific ways that mattered.\"",
    "p8": "\"I accept my 15% accountability. But the real lesson is this: When you expand an autonomous system beyond its certified mission, you're not just changing what it shoots at. You're inheriting design choices made for a different problem. And those choices have consequences you might not see until someone dies.\""
  },
  
  "protocols": {
    "title": "Six Months Later: Updated Protocols",
    "mission_title": "1. Mission Expansion Review Process",
    "mission_p1": "All mission expansions beyond certified parameters require:",
    "mission_r1": "Technical assessment of design limitations",
    "mission_r2": "Review of developer documentation for warnings",
    "mission_r3": "Tactical assessment of operational suitability",
    "mission_p2": "Field authorization allowed only if:",
    "mission_allowed1": "Combat emergency requires immediate action",
    "mission_allowed2": "Technical limitations acknowledged in authorization log",
    "mission_allowed3": "Enhanced audit captures all known risks",
    "critical_title": "2. Critical Limitation Classification",
    "critical_p1": "Developers must flag limitations as:",
    "critical_eng": "ENGINEERING (technical detail, developer-facing)",
    "critical_op": "OPERATIONAL (affects standard use, operator training required)",
    "critical_crit": "CRITICAL (mission expansion risk, mandatory operator warning)",
    "critical_p2": "Git provenance audited for CRITICAL limitations before deployment.",
    "training_title": "3. Operator Training Integration",
    "training_p1": "All autonomous systems training includes:",
    "training_i1": "Weapon ballistics module (pellet spread, dispersion, lateral danger zones)",
    "training_i2": "Design tradeoff briefing (why this weapon? what limitations?)",
    "training_i3": "Developer warning review (what did engineers flag as risks?)",
    "dev_title": "4. Development Accountability Chain",
    "dev_p1": "Every engagement log includes:",
    "dev_i1": "Operator authorization (who approved)",
    "dev_i2": "Command approval (who authorized mission)",
    "dev_i3": "Design provenance (who coded the engaged rule, what warnings documented)",
    "dev_p2": "Investigations automatically pull git logs for systems involved in incidents."
  },
  
  "nato": {
    "title": "For NATO and EU Regulators",
    "intro": "As NATO develops AI certification standards and the EU AI Act requires conformity assessments, this case reveals three critical lessons:",
    "cert_title": "1. Certification Must Include Prohibited Uses",
    "cert_current": "Current approach:",
    "cert_current_text": "\"This system is certified for anti-drone defense.\"",
    "cert_problem": "Problem:",
    "cert_problem_text": "Doesn't tell you what happens if you repurpose it.",
    "cert_better": "Better approach:",
    "cert_certified": "Certified for: Anti-drone defense, controlled airspace, no friendlies <100m",
    "cert_not": "NOT certified for: Anti-personnel use (lateral spread risk), urban environments, mixed units (friendly fire risk)",
    "cert_conclusion": "Explicit limitations prevent mission creep by making risks visible.",
    "prov_title": "2. Development Provenance Must Be Auditable",
    "prov_trace": "This investigation required tracing:",
    "prov_who": "Who selected shotgun ammunition? (Dr. Andersson)",
    "prov_what": "What warnings were documented? (Git commit a3f4e9c)",
    "prov_why": "Why was this design chosen? (Anti-drone hit probability vs collateral damage)",
    "prov_limits": "What limitations were noted? (\"Not suitable for precision anti-personnel use\")",
    "prov_without": "Without git provenance, this information would be lost.",
    "prov_require": "Conformity assessment must require:",
    "prov_req1": "Complete development history (git logs, design decisions, rationale)",
    "prov_req2": "Critical limitation flagging (developer warnings elevated to operator training)",
    "prov_req3": "Audit trail from design choice to operational consequence",
    "acct_title": "3. Accountability Must Be Systemic, Not Individual",
    "acct_elena": "If investigation blamed only Elena:",
    "acct_elena_text": "Punishment, no learning.",
    "acct_dev": "If investigation blamed only developer:",
    "acct_dev_text": "Chilling effect on documentation.",
    "acct_shared": "Shared accountability model enables learning without scapegoating:",
    "acct_list": "Elena: 25% • Petrov: 15% • System design: 20% • Developer: 15% • Training: 15% • Chaos of war: 10%",
    "acct_everyone": "Everyone improves procedures. Nobody is scapegoated."
  },
  
  "invitation": {
    "title": "An Invitation to Defense Community",
    "based": "This thought experiment is based on documented realities:",
    "i1": "Real Ukrainian drone threat (250-1,000/day documented)",
    "i2": "Real autonomous turret technology (Sky Sentinel, Bullfrog)",
    "i3": "Real Russian tactical adaptation (documented pattern)",
    "i4": "Real shotgun ballistics (15° dispersion characteristics)",
    "i5": "Real development practices (git provenance, commit logs)",
    "not_validated": "But it's not yet validated with real investigations.",
    "questions": "Questions for testing:",
    "q1": "Would real investigations trace development provenance?",
    "q2": "Would real training systems integrate developer warnings?",
    "q3": "Would real operators verify ballistic paths beyond targets?",
    "q4": "Would real review boards assign shared accountability?",
    "seeking": "Seeking partners to validate:",
    "s1": "Investigation procedures for autonomous weapons incidents",
    "s2": "Development-to-operations information flow",
    "s3": "Operator training on system limitations",
    "s4": "Accountability frameworks for mission expansion decisions"
  },
  
  "contact": {
    "label": "Contact:",
    "email": "samuel@dynorobotics.se",
    "bio": "Samuel Lindgren develops accountability frameworks for autonomous weapons systems."
  }
}

